In [ ]:
Author ="Abou SANOU"

import of required packages

In [1]:
import pandas as pd 
import numpy as np
import warnings
warnings.filterwarnings('ignore')

Loading of the data

In [2]:
cities = pd.read_csv("data/cities.csv") 
providers = pd.read_csv("data/providers.csv") 
stations = pd.read_csv("data/stations.csv") 
ticket_data = pd.read_csv("data/ticket_data.csv")

Statistiques descriptive pour comprendre les données à savoir les features

In [3]:
cities.head()

,id,local_name,unique_name,latitude,longitude,population
0,5159,"Padua, Veneto, Italia",padua,45.406435,11.876761,209678.0
1,76,"Barcelona, Cataluña, España",barcelona,41.385064,2.173404,1611822.0
2,81,"Basel, Basel-Stadt, Schweiz",basel,47.593437,7.619812,NaN
3,259,"Erlangen, Bayern, Deutschland",erlangen,49.589674,11.011961,105412.0
4,11979,"Balș, Olt, România",balș,44.353354,24.095672,NaN

In [4]:
providers.head()

,id,company_id,provider_id,name,fullname,has_wifi,has_plug,has_adjustable_seats,has_bicycle,transport_type
0,9,1,NaN,ouibus,Ouibus,True,True,True,False,bus
1,10,2,NaN,deinbus,Deinbus.de,False,False,False,False,bus
2,11,3,NaN,infobus,Infobus,False,False,False,False,bus
3,12,4,NaN,studentAgency,Student Agency,False,False,False,False,bus
4,13,5,NaN,flixbus,Flixbus,True,False,False,False,bus

In [5]:
stations.head()

   id                     unique_name   latitude  longitude
0   1      Aalen (Stuttgarter Straße)  48.835296  10.092956
1   2      Aéroport Bordeaux-Mérignac  44.830226  -0.700883
2   3                   Aéroport CDG   49.009900   2.559310
3   4  Aéroport de Berlin-Schönefeld   52.389446  13.520345
4   5             Aéroport de Dresden  51.123604  13.764737

In [6]:
ticket_data.head()

,id,company,o_station,d_station,departure_ts,arrival_ts,price_in_cents,search_ts,middle_stations,other_companies,o_city,d_city
0,6795025,8385,NaN,NaN,2017-10-13 14:00:00+00,2017-10-13 20:10:00+00,4550,2017-10-01 00:13:31.327+00,NaN,NaN,611,542
1,6795026,9,63.0,1044.0,2017-10-13 13:05:00+00,2017-10-14 06:55:00+00,1450,2017-10-01 00:13:35.773+00,"{149,418}",{13},611,542
2,6795027,8377,5905.0,6495.0,2017-10-13 13:27:00+00,2017-10-14 21:24:00+00,7400,2017-10-01 00:13:40.212+00,"{798,798,6794,6246}","{8377,8376}",611,542
3,6795028,8377,5905.0,6495.0,2017-10-13 13:27:00+00,2017-10-14 11:02:00+00,13500,2017-10-01 00:13:40.213+00,"{798,798,6794,6246}","{8377,8376}",611,542
4,6795029,8381,5905.0,6495.0,2017-10-13 21:46:00+00,2017-10-14 19:32:00+00,7710,2017-10-01 00:13:40.213+00,"{5983,5983}",{8380},611,542

Bilan des valeurs nulles

In [7]:
ticket_data.isnull().sum()

id                     0
company                0
o_station          41441
d_station          41441
departure_ts           0
arrival_ts             0
price_in_cents         0
search_ts              0
middle_stations    41441
other_companies    41441
o_city                 0
d_city                 0
dtype: int64

Bien formater les données pour les differents requetes

In [8]:
ticket_data['arrival_ts'] = pd.to_datetime(ticket_data['arrival_ts'])
ticket_data['departure_ts'] = pd.to_datetime(ticket_data['departure_ts'])

Calculer la durée des trajets

In [9]:
ticket_data['duration'] = ticket_data['arrival_ts'] - ticket_data['departure_ts']

Convertir la durée du type timedelta à int afin de faire le groupby

In [10]:
ticket_data['duration_numeric'] = ticket_data['duration'].values.astype(np.int64)

Prix min, moyen et max par trajet; trajet est un couple 'o_city', 'd_city'

In [11]:
ticket_price_by_trajet = ticket_data.groupby(['o_city', 'd_city']).agg({'price_in_cents': ['mean', 'min', 'max']})

In [12]:
print(ticket_price_by_trajet)

              price_in_cents
                        mean    min    max
o_city d_city
5      23       20320.000000  18600  22000
6      227      11755.000000   9860  13650
       504       4042.666667   2000   8920
       628       2797.500000   2600   3190
       845        864.626866    700   2420
...                      ...    ...    ...
11938  126       4204.861111   3000   5350
12124  1064      6950.000000   6000   7900
12166  857       5300.000000   5300   5300
12190  639        688.888889    600    850
       8937      9800.000000   9800   9800

[1437 rows x 3 columns]

Durée min, moyen et max par trajet; trajet est un couple 'o_city', 'd_city'

Un trajet est constitué d'un point de depart et d'un point d'arrivée
nous calculons la moyenne, le min et le max de la durée par trajet

In [13]:
ticket_duration_by_trajet = ticket_data.groupby(['o_city', 'd_city']).agg({'duration_numeric': ['mean', 'min', 'max']})

In [14]:
#supprimer la meta ligne generer par l'operateur agg
ticket_duration_by_trajet.columns = ticket_duration_by_trajet.columns.droplevel(0)
#convertir en timedelta plus parlant
ticket_duration_by_trajet['mean'] = pd.to_timedelta(ticket_duration_by_trajet['mean'])
ticket_duration_by_trajet['min'] = pd.to_timedelta(ticket_duration_by_trajet['min'])
ticket_duration_by_trajet['max'] = pd.to_timedelta(ticket_duration_by_trajet['max'])

In [15]:
print(ticket_duration_by_trajet)

                                   mean             min             max
o_city d_city
5      23               0 days 10:18:48 0 days 08:53:00 0 days 15:54:00
6      227              0 days 13:42:30 0 days 12:24:00 0 days 15:01:00
       504              0 days 08:17:24 0 days 05:36:00 0 days 12:20:00
       628              0 days 12:10:00 0 days 09:40:00 0 days 14:30:00
       845    0 days 01:19:54.626865671 0 days 01:00:00 0 days 04:11:00
...                                 ...             ...             ...
11938  126    0 days 07:25:16.666666666 0 days 05:30:00 1 days 11:20:00
12124  1064             0 days 17:10:00 0 days 11:10:00 0 days 23:10:00
12166  857              0 days 21:55:00 0 days 21:55:00 0 days 21:55:00
12190  639    0 days 01:28:53.333333333 0 days 01:10:00 0 days 02:40:00
       8937             0 days 09:10:00 0 days 09:10:00 0 days 09:10:00

[1437 rows x 3 columns]

Merger les données afin d'ajouter long et lat de o_city à notre dataset de base

In [16]:
ticket_providers = pd.merge(ticket_data, providers, how='right', left_on=['company'], right_on=['id'])

In [17]:
data_part_1 = pd.merge(ticket_providers, cities[['id', 'latitude', 'longitude']], how='right', left_on=['o_city'], right_on=['id'],suffixes = ("","_o_city"))

In [18]:
data_with_all_coord = pd.merge(data_part_1, cities[['id', 'latitude', 'longitude']], how='right', left_on=['d_city'], right_on=['id'],suffixes = ("","_d_city"))

In [19]:
dat = data_with_all_coord[['id','o_city','d_city','duration','price_in_cents','longitude','latitude', 'longitude_d_city','latitude_d_city','transport_type','duration_numeric']]
data_filter = dat[['id','o_city','d_city','duration','price_in_cents','longitude','latitude', 'longitude_d_city','latitude_d_city','transport_type' ,'duration_numeric']]

Function de calcul de la distance. Cette function est la plus proche de la realité.
Car afin d'avoir la vrai distance, il faut qu'on utilise une api par exemple de google.

In [20]:
def haversine_vectorize(lon1, lat1, lon2, lat2):
    lon1, lat1, lon2, lat2 = map(np.radians, [lon1, lat1, lon2, lat2])
    newlon = lon2 - lon1
    newlat = lat2 - lat1
    haver_formula = np.sin(newlat/2.0)**2 + np.cos(lat1) * np.cos(lat2) * np.sin(newlon/2.0)**2
    dist = 2 * np.arcsin(np.sqrt(haver_formula))
    km = 6367 * dist
    return km

Calcule de la distance de chaque trajet

In [21]:
data_filter['distance'] = haversine_vectorize(data_filter['longitude'],data_filter['latitude'],data_filter['longitude_d_city'],data_filter['latitude_d_city'])

In [22]:
data_filter['distance']

0               NaN
1        157.333773
2        157.333773
3        157.333773
4        157.333773
            ...
81871     76.162660
81872     76.162660
81873     76.162660
81874           NaN
81875           NaN
Name: distance, Length: 81876, dtype: float64

Prix et durée moyen par trajet et par type de transport

In [23]:
price_mean_by_trajet_transport = data_filter.groupby(['o_city', 'd_city','transport_type']).agg({'price_in_cents': ['mean'], 'duration_numeric': ['mean']})

In [24]:
print(price_mean_by_trajet_transport)

                              price_in_cents duration_numeric
                                        mean             mean
o_city  d_city transport_type
5.0     23.0   train            20320.000000     3.712800e+13
6.0     227.0  train            11755.000000     4.935000e+13
        504.0  bus               3104.210526     3.387158e+13
               carpooling        4050.000000     2.370000e+13
               train             6585.714286     2.242286e+13
...                                      ...              ...
12124.0 1064.0 bus               6000.000000     8.340000e+13
               carpooling        7900.000000     4.020000e+13
12166.0 857.0  bus               5300.000000     7.890000e+13
12190.0 639.0  carpooling         688.888889     5.333333e+12
        8937.0 bus               9800.000000     3.300000e+13

[2704 rows x 2 columns]

Prix et durée moyen par type de transport

In [25]:
price_mean_by_kind_transport = data_filter.groupby(['transport_type']).agg({'price_in_cents': ['mean'], 'duration_numeric': ['mean']})

In [26]:
print(price_mean_by_kind_transport)

               price_in_cents duration_numeric
                         mean             mean
transport_type
bus               3652.448036     5.627977e+13
carpooling        2742.171907     1.479833e+13
train             8506.634793     2.640344e+13

Prix et durée moyen par type de transport et pqr trajet

 selon la distance du trajet (0-200km, 201-800km, 800-2000km, 2000+km) on calcule la moyenne de durée

In [27]:
duration_by_interval = dat.groupby(pd.cut(data_filter["distance"], [0,200,800, 2000, 3000])).agg({'duration_numeric': ['mean']})

In [28]:
print(duration_by_interval)

             duration_numeric
                         mean
distance
(0, 200]         1.131146e+13
(200, 800]       2.725378e+13
(800, 2000]      8.297652e+13
(2000, 3000]              NaN

In [30]:
duration_by_interval.columns = duration_by_interval.columns.droplevel(0)
duration_by_interval['duration'] = pd.to_timedelta(duration_by_interval['mean'])

In [33]:
print(duration_by_interval)

                      mean                  duration
distance
(0, 200]      1.131146e+13 0 days 03:08:31.458303012
(200, 800]    2.725378e+13 0 days 07:34:13.780050629
(800, 2000]   8.297652e+13 0 days 23:02:56.515634971
(2000, 3000]           NaN                       NaT

selon la distance du trajet (0-200km, 201-800km, 800-2000km, 2000+km) on calcule la moyenne du prix

In [31]:
price_by_interval = dat.groupby(pd.cut(data_filter["distance"], [0,200,800, 2000, 3000])).agg({'price_in_cents': ['mean']})

In [34]:
print(price_by_interval)

             price_in_cents
                       mean
distance
(0, 200]        1680.757968
(200, 800]      4894.402844
(800, 2000]     8857.869177
(2000, 3000]            NaN